---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeError
source: html/5d819cec-31a8-119d-c8a1-ca5e7d7c4a17.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeError Property

The selected fitting(s) cannot successfully change the type. You must disconnect the connections on the fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeError { get; }
```